 #include "TextInformation.h"

string TextInformation::DataWithText(int num) {
	if (num == 1)
		return "Танк Challenger 2 є основним бойовим танком Британської армії.\nОсновні характеристики:\n\tГоловна зброя: Гладкоствольна гармата L30A1 (120 мм).\n\tЕкіпаж: Зазвичай 4 особи (командир, стрілець-наводчик, водій та зарядник).\n\tБронювання: Використовує комбіноване бронювання для максимального захисту від бронебійних снарядів і інших загроз.\n\tДвигун: Дизельний двигун.\n\tШвидкість: Максимальна швидкість на дорозі близько 59 км/год.\nЩодо снарядів та дальності стрільби:\n\tСнаряди: Challenger 2 використовує різні типи сучасних снарядів, включаючи бронебійні, вибухові та кумулятивні снаряди.\n\tДальність пострілу 8 км.";

	else if (num == 2)
	{

	}
	else if (num == 3)
	{

	}
	else if (num == 4)
	{

	}
	else if (num == 5)
	{

	}
	else if (num == 6)
	{

	}
	else if (num == 7)
	{

	}


	return "se";
}
